import path from 'path'
import express from 'express'
import bodyParser from 'body-parser'
import cors from 'cors'
import mongoose from 'mongoose'
import { router } from './src/database/routes/route.js'
import { data } from './src/api/getData.js'
import { useEnv } from './src/hooks/useEnv.js'
useEnv()

const app = express()
const PORT = process.env.PORT || 3000
const __dirname = path.resolve()
const __public = path.join(__dirname, 'public')
const __build = path.join(__dirname, '../', 'client', 'build')

app.use(express.static(__build))
app.use(cors())
app.options('*', cors())
app.use(bodyParser.json({ limit: '50mb' }))
app.use(
  bodyParser.urlencoded({
    limit: '50mb',
    extended: true,
    parameterLimit: 50000,
  }),
)

app.get('/data', (req, res) => {
  res.json(data)
})

app.use('/api', router)

app.get('/*', (req, res) => {
  res.sendFile(path.join(__build, 'index.html'))
})

const mongodbURL = process.env.MONGODB_URL

mongoose
  .connect(mongodbURL)
  .then(() => {
    console.log('Connected to database!')
    app.listen(PORT, () => console.log(`Server running on port ${PORT}...`))
  })
  .catch(() => {
    console.log('Connection to database failed')
  })

const obj = {
  Аспирантура: {
    'Биологические науки (06.06.01), Физическая культура и спорт (49.06.01)': {
      '3 курс': {
        'Все научные специальности': {
          '49.06.01 Физическая культура и спорт Направленность (профиль) ОП: Теория иметодика физического воспитания, спортивной тренировки, оздоровительной и адаптивной физической культуры - педагогические науки':
            {
              '28.08-02.09': {
                '28.08. (Пн.)': {
                  '09:45':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '11:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '13:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  15.15:
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '17:00':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                },
                '29.08. (Вт.)': {
                  '09:45':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '11:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '13:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  15.15:
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '17:00':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                },
                '30.08. (Ср.)': {
                  '09:45':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '11:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '13:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  15.15:
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '17:00':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                },
                '31.08. (Чт.)': {
                  '9:45':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '11:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '13:30':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '15:15':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                  '17:00':
                    'КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08 КАНИКУЛЫ 03.07 - 31.08',
                },
                '01.09. (Пт.)': {
                  '09:45': '',
                  '11:30': '',
                  '13:30': '',
                  15.15: '',
                  '17:00': '',
                },
                '02.09. (Сб.)': {
                  '09:45': '',
                  '11:30': '',
                  '13:30': '',
                  15.15: '',
                  '17.00': '',
                },
              },
            },
        },
      },
    },
  },
}
